IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_clb_logic_control_regs.xml
<module id="CLB_LOGIC_CONTROL_REGS" HW_revision="" description="CLB LOGIC CONTROL Registers">
	<register id="CLB_LOAD_EN" width="16" page="1" offset="0x0" internal="0" description="Global enable and indirect load enable control, only Global Enable Bit is LOCK protected">
		<bitfield id="LOAD_EN" description="Load Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GLOBAL_EN" description="Global Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="STOP" description="Debug stop control" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="NMI_EN" description="NMI output enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="PIPELINE_EN" description="Enable input pipelining" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_LOAD_ADDR" width="32" page="1" offset="0x2" internal="0" description="Indirect address">
		<bitfield id="ADDR" description="Indirect Address" begin="5" end="0" width="6" rwaccess="RW"/>
	</register>
	<register id="CLB_LOAD_DATA" width="32" page="1" offset="0x4" internal="0" description="Data for indirect loads">
		<bitfield id="DATA" description="Data for indirect write" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CLB_INPUT_FILTER" width="32" page="1" offset="0x6" internal="0" description="Input filter selection for both edge detection and synchronizers">
		<bitfield id="FIN0" description="Input filter control 0" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="FIN1" description="Input filter control 1" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="FIN2" description="Input filter control 2" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="FIN3" description="Input filter control 3" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="FIN4" description="Input filter control 4" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="FIN5" description="Input filter control 5" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="FIN6" description="Input filter control 6" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="FIN7" description="Input filter control 7" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="SYNC0" description="Synchronizer control 0" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SYNC1" description="Synchronizer control 1" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SYNC2" description="Synchronizer control 2" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SYNC3" description="Synchronizer control 3" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SYNC4" description="Synchronizer control 4" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SYNC5" description="Synchronizer control 5" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SYNC6" description="Synchronizer control 6" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SYNC7" description="Synchronizer control 7" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="PIPE0" description="Enable pipeline 0" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="PIPE1" description="Enable pipeline 1" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="PIPE2" description="Enable pipeline 2" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="PIPE3" description="Enable pipeline 3" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="PIPE4" description="Enable pipeline 4" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="PIPE5" description="Enable pipeline 5" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="PIPE6" description="Enable pipeline 6" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="PIPE7" description="Enable pipeline 7" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_IN_MUX_SEL_0" width="32" page="1" offset="0x8" internal="0" description="Input selection to decide between Signals and GP register">
		<bitfield id="SEL_GP_IN_0" description="Select GP register 0" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SEL_GP_IN_1" description="Select GP register 1" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SEL_GP_IN_2" description="Select GP register 2" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SEL_GP_IN_3" description="Select GP register 3" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SEL_GP_IN_4" description="Select GP register 4" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SEL_GP_IN_5" description="Select GP register 5" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SEL_GP_IN_6" description="Select GP register 6" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SEL_GP_IN_7" description="Select GP register 7" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_LCL_MUX_SEL_1" width="32" page="1" offset="0xa" internal="0" description="Input Mux selection for local mux">
		<bitfield id="LCL_MUX_SEL_IN_0" description="Local Mux select 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="LCL_MUX_SEL_IN_1" description="Local Mux select 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="LCL_MUX_SEL_IN_2" description="Local Mux select 2" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="LCL_MUX_SEL_IN_3" description="Local Mux select 3" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="MISC_INPUT_SEL_0" description="Select MISC_INPUT" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="MISC_INPUT_SEL_1" description="Select MISC_INPUT" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="MISC_INPUT_SEL_2" description="Select MISC_INPUT" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="MISC_INPUT_SEL_3" description="Select MISC_INPUT" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_LCL_MUX_SEL_2" width="32" page="1" offset="0xc" internal="0" description="Input Mux selection for local mux">
		<bitfield id="LCL_MUX_SEL_IN_4" description="Local Mux select 4" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="LCL_MUX_SEL_IN_5" description="Local Mux select 5" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="LCL_MUX_SEL_IN_6" description="Local Mux select 6" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="LCL_MUX_SEL_IN_7" description="Local Mux select 7" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="MISC_INPUT_SEL_4" description="Select MISC_INPUT" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="MISC_INPUT_SEL_5" description="Select MISC_INPUT" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="MISC_INPUT_SEL_6" description="Select MISC_INPUT" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="MISC_INPUT_SEL_7" description="Select MISC_INPUT" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_BUF_PTR" width="32" page="1" offset="0xe" internal="0" description="PUSH and PULL pointers">
		<bitfield id="PULL" description="Data pointer for pull" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="PUSH" description="Data pointer for pull" begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_GP_REG" width="32" page="1" offset="0x10" internal="0" description="General purpose register for CELL inputs">
		<bitfield id="REG" description="General Purpose bit register" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="SW_GATING_CTRL_0" description="Software gating control 0" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SW_GATING_CTRL_1" description="Software gating control 1" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SW_GATING_CTRL_2" description="Software gating control 2" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SW_GATING_CTRL_3" description="Software gating control 3" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SW_GATING_CTRL_4" description="Software gating control 4" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SW_GATING_CTRL_5" description="Software gating control 5" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SW_GATING_CTRL_6" description="Software gating control 6" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SW_GATING_CTRL_7" description="Software gating control 7" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="SW_RLS_CTRL_0" description="Software release control 0" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="SW_RLS_CTRL_1" description="Software release control 1" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="SW_RLS_CTRL_2" description="Software release control 2" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="SW_RLS_CTRL_3" description="Software release control 3" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="SW_RLS_CTRL_4" description="Software release control 4" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="SW_RLS_CTRL_5" description="Software release control 5" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="SW_RLS_CTRL_6" description="Software release control 6" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="SW_RLS_CTRL_7" description="Software release control 7" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_OUT_EN" width="32" page="1" offset="0x12" internal="0" description="CELL output enable register">
		<bitfield id="OUTEN" description="CLB output enable" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CLB_GLBL_MUX_SEL_1" width="32" page="1" offset="0x14" internal="0" description="Global Mux select for CELL inputs">
		<bitfield id="GLBL_MUX_SEL_IN_0" description="Global Mux select 0" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="GLBL_MUX_SEL_IN_1" description="Global Mux select 1" begin="13" end="7" width="7" rwaccess="RW"/>
		<bitfield id="GLBL_MUX_SEL_IN_2" description="Global Mux select 2" begin="20" end="14" width="7" rwaccess="RW"/>
		<bitfield id="GLBL_MUX_SEL_IN_3" description="Global Mux select 3" begin="27" end="21" width="7" rwaccess="RW"/>
	</register>
	<register id="CLB_GLBL_MUX_SEL_2" width="32" page="1" offset="0x16" internal="0" description="Global Mux select for CELL inputs">
		<bitfield id="GLBL_MUX_SEL_IN_4" description="Global Mux select 4" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="GLBL_MUX_SEL_IN_5" description="Global Mux select 5" begin="13" end="7" width="7" rwaccess="RW"/>
		<bitfield id="GLBL_MUX_SEL_IN_6" description="Global Mux select 6" begin="20" end="14" width="7" rwaccess="RW"/>
		<bitfield id="GLBL_MUX_SEL_IN_7" description="Global Mux select 7" begin="27" end="21" width="7" rwaccess="RW"/>
	</register>
	<register id="CLB_PRESCALE_CTRL" width="32" page="1" offset="0x18" internal="0" description="Prescaler register control">
		<bitfield id="CLKEN" description="Enable the prescale clock generator" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="STRB" description="Enable the Strobe mode of operation" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TAP" description="TAP Select value" begin="5" end="2" width="4" rwaccess="RW"/>
		<bitfield id="PRESCALE" description="Value of prescale register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CLB_INTR_TAG_REG" width="16" page="1" offset="0x20" internal="0" description="Interrupt Tag register">
		<bitfield id="TAG" description="Interrupt tag" begin="5" end="0" width="6" rwaccess="RW"/>
	</register>
	<register id="CLB_LOCK" width="32" page="1" offset="0x22" internal="0" description="Lock control register">
		<bitfield id="LOCK" description="LOCK enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key for enabling write" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CLB_HLC_INSTR_READ_PTR" width="16" page="1" offset="0x24" internal="0" description="HLC instruction read pointer">
		<bitfield id="READ_PTR" description="HLC instruction read pointer" begin="4" end="0" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_HLC_INSTR_VALUE" width="16" page="1" offset="0x26" internal="0" description="HLC instruction read value">
		<bitfield id="INSTR" description="HLC instruction value" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="CLB_DBG_OUT_2" width="32" page="1" offset="0x2e" internal="0" description="Visibility for CLB inputs and final  asynchronous outputs">
		<bitfield id="OUT" description="Outputs of CLB Async block" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="IN" description="CLB CELL Inputs" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_DBG_R0" width="32" page="1" offset="0x30" internal="0" description="R0 of High level Controller">
		<bitfield id="DBG" description="CLB_DBG_R0" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CLB_DBG_R1" width="32" page="1" offset="0x32" internal="0" description="R1 of High level Controller">
		<bitfield id="DBG" description="CLB_DBG_R1" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CLB_DBG_R2" width="32" page="1" offset="0x34" internal="0" description="R2 of High level Controller">
		<bitfield id="DBG" description="CLB_DBG_R2" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CLB_DBG_R3" width="32" page="1" offset="0x36" internal="0" description="R3 of High level Controller">
		<bitfield id="DBG" description="CLB_DBG_R3" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CLB_DBG_C0" width="32" page="1" offset="0x38" internal="0" description="Count of Unit 0">
		<bitfield id="DBG" description="CLB_DBG_C0" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CLB_DBG_C1" width="32" page="1" offset="0x3a" internal="0" description="Count of Unit 1">
		<bitfield id="DBG" description="CLB_DBG_C1" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CLB_DBG_C2" width="32" page="1" offset="0x3c" internal="0" description="Count of Unit 2">
		<bitfield id="DBG" description="CLB_DBG_C2" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CLB_DBG_OUT" width="32" page="1" offset="0x3e" internal="0" description="Outputs of various units in the Cell">
		<bitfield id="COUNT0_MATCH2" description="COUNT_MATCH2 UNIT 0" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="COUNT0_ZERO" description="COUNT_ZERO UNIT 0" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="COUNT0_MATCH1" description="COUNT_MATCH1 UNIT 0" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="FSM0_S0" description="FSM_S0 UNIT 0" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="FSM0_S1" description="FSM_S1 UNIT 0" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="FSM0_LUTOUT" description="FSM_LUT_OUT UNIT 0" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="LUT40_OUT" description="LUT4_OUT UNIT 0" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="COUNT1_MATCH2" description="COUNT_MATCH2 UNIT 1" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="COUNT1_ZERO" description="COUNT_ZERO UNIT 1" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="COUNT1_MATCH1" description="COUNT_MATCH1 UNIT 1" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="FSM1_S0" description="FSM_S0 UNIT 1" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="FSM1_S1" description="FSM_S1 UNIT 1" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="FSM1_LUTOUT" description="FSM_LUT_OUT UNIT 1" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="LUT41_OUT" description="LUT4_OUT UNIT 1" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="COUNT2_MATCH2" description="COUNT_MATCH2 UNIT 2" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="COUNT2_ZERO" description="COUNT_ZERO UNIT 2" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="COUNT2_MATCH1" description="COUNT_MATCH1 UNIT 2" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="FSM2_S0" description="FSM_S0 UNIT 2" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="FSM2_S1" description="FSM_S1 UNIT 2" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="FSM2_LUTOUT" description="FSM_LUT_OUT UNIT 2" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="LUT42_OUT" description="LUT4_OUT UNIT 2" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="OUT0" description="CELL Output 0" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="OUT1" description="CELL Output 1" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="OUT2" description="CELL Output 2" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="OUT3" description="CELL Output 3" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="OUT4" description="CELL Output 4" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="OUT5" description="CELL Output 5" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="OUT6" description="CELL Output 6" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="OUT7" description="CELL Output 7" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
</module>
